{"query":{"pages":{"77":{"pageid":77,"ns":0,"title":"Website\/DemoContent","revisions":[{"contentformat":"text\/x-wiki","contentmodel":"wikitext","*":"This is the Homepage's demo markdown content:\n\n<nowiki>\nMarkdown Viewer\n==========\n\nA simple live markdown editor built with [markdown.js](https:\/\/github.com\/evilstreak\/markdown-js). Supports John Gruber's original markdown dialect.\n\nHeadings\n-----\n\n# First-level heading\n \n#### Fourth-level heading\n\nThe first two heading levels also have an alternative syntax:\n\nFirst-level heading\n===================\n \nSecond-level heading\n--------------------\n\nParagraphs\n----------\nA paragraph is one or more consecutive lines of text separated by one or more blank lines. Normal paragraphs should not be indented with spaces or tabs:\n\nThis is a paragraph. It has two sentences.\n\nThis is another paragraph. It also has \ntwo sentences.\n\nLists\n--------\n* An item in a bulleted (unordered) list\n    * A subitem, indented with 4 spaces\n* Another item in a bulleted list  \n- - -\n1. An item in an enumerated (ordered) list  \n    1.1. A subitem, indented with 4 spaces\n2. Another item in an enumerated list\n\nLine return\n----------\nLine breaks inserted in the text are removed from the final result: the web browser is in charge of breaking lines depending on the available space. To force a line break, insert two spaces at the end of the line.\n\nEmphasized text\n-----------------\n*emphasis* or _emphasis_  (e.g., italics)  \n**strong emphasis** or __strong emphasis__ (e.g., boldface)\n\nCode\n--------------\nTo include code (formatted in monospace font), you can either surround inline code with backticks, like in\n\nSome text with `some code` inside,\n\nor indent several lines of code by at least four spaces, as in:\n\n    line 1 of code   \n    line 2 of code    \n    line 3 of code   \n\nThe latter option makes Markdown retain all whitespace,as opposed to the usual behaviour, which, by removing line breaks and excess spaces, would break indentation and code layout.\n\nLine breaks\n-------------\nWhen you do want to insert a break tag using Markdown, you end a line with two or more spaces, then type return. For example:\n\ndef show_results  \nend  \n\nYou can also use two newlines. For example:  \n\nsentence A\n\nsentence B\n\nBlockquotes\n--------\n\n> \"This entire paragraph of text will be enclosed in an HTML blockquote element.\nBlockquote elements are reflowable. You may arbitrarily\nwrap the text to your liking, and it will all be parsed\ninto a single blockquote element.\"\n\nExternal links\n------\nLinks may be included inline:\n[link text here](link.address.here)\nEx. [Markdown](http:\/\/en.wikipedia.com\/wiki\/Markdown)\n\nAlternatively, links can be placed in footnotes outside of the paragraph, being referenced with some sort of reference tag. For example, including the following inline:\n\n[link text here][linkref]\n\nwould produce a link if the following showed up outside of the paragraph (or at the end of the document):\n\n[linkref]: link.address.here \"link title here\"\n\nImages\n---------------\nImages have similar syntax to links with a preceding exclamation point.\n\n![Alt text](\/path\/to\/img.jpg)\nor\n![Alt text](\/path\/to\/img.jpg \"Optional title\")\n\nLike links, Images also have a footnote style syntax\n\n![Alt text][id]\n\nwith a reference later in the document defining the url location\n\n[id]: url\/to\/image  \"Optional title attribute\"\n\nHorizontal rules\n-----------------\nHorizontal rules are created by placing three or more hyphens, asterisks, or underscores on a line by themselves. You may use spaces between the hyphens or asterisks. Each of the following lines will produce a horizontal rule:\n* * *\n***\n*****\n-----------------------------\n- - -\n<\/nowiki>"}]}}}}
